# 자연어 처리(natural language processing, NLP)
# 컴퓨터를 사용해 인간의 언어를 처리하는 분야
# 대표적엔 세부 분야로는 음성 인식, 기계 번역, 감성 분석 들이 있다
# IMDB 리뷰를 감상평에 따라 분류하는 작업은 감성 분석에 해당한다

# 자연어 처리 분야에서는 훈련 데이터를 종종 말뭉치(corpus)라고 부른다
# 예를 들어 IMDB 리뷰 데이터셋이 하나의 말뭉치이다

# 텍스트 자체를 신경망에 전달하지는 않는다
# 컴퓨터에서는 처리하는 모든 것은 어떤 숫자 데이터이다
# 이미지는 정수 픽셀값으로 이루어져 있어 특별한 변환을 하지 않는다

# 텍스트 데이터의 경우 단어를 숫자 데이터로 바꾸는 일반적인 방법은 데이터에 등장하는
# 단어마다 고유한 정수를 부여하는 것이다
# 각 단어를 하나의 정수에 매핑하고 동일한 단어는 동일한 정수에 매핑한다
# 단어에 매핑되는 정수는 단어의 의미나 크기와 관련이 없다
# 정수값 사이에는 어떤 관계도 없다

# 일반적으로 영어 문장은 모두 소문자로 바꾸고 구둣점을 삭제한 다음 공백을 기분으로 분리한다
# 이렇게 분리된 단어를 토큰(token)이라고 부른다
# 하나의 샘플은 여러 개의 토큰으로 이루어져 있고 1개의 토큰이 하나의 타임스텝에 해당한다
# 간단한 문제라면 영어 말뭉치에서 토큰을 단어와 같게 봐도 좋다

# 한글 문장은 다른데 한글은 조사가 발달되어 있기 때문에 공백으로 나누는 것만으로는 부족하다
# 일반적으로 한글은 형태소 분석을 통해 토큰을 만든다

# 토큰에 할당하는 정수 중에 몇 개는 특정한 용도로 예약되어 있는 경우가 많다
# 예를 들어 0은 패딩, 1은 문장의 시작, 2는 어휘 사전에 없는 토큰을 나타낸다

# 어휘 사전은 훈련 세트에서 고유한 단어를 뽑아 만든 목록이다
# 예를 들어 테스트 세트 안에 어휘 사전에 없는 단어가 있다면 2로 변환하여 신경망 모델에 주입한다

# 실제 IMDB 리뷰 데이터셋은 영어로 된 문장이지만 텐서플로에는 이미 정수로 바꾼 데이터가 포함되어 있다

# tensorflow.keras.datasets 패키지 아래 imdb 모듈 임포트
# 전체 데이터셋에서 가장 자주 등장하는 단어 300개만 사용
# load_data 함수의 num_words 매개변수를 300으로 지정
from tensorflow.keras.datasets import imdb

(train_input, train_target), (test_input, test_target) = imdb.load_data(num_words=300)