# 정형 데이터(structured data)
# 어떤 구조로 되어 있는 데이터
# 이런 데이터는 csv나 데이터베이스 혹은 엑셀에 저장하기 쉽다
# 프로그래머가 다루는 대부분의 데이터가 정형데이터이다

# 비정형 데이터(unstructured data)
# 데이터베이스나 엑셀로 표현하기 어려운 것들
# 사진, 음악 등이 있다

# 앙상블 학습(ensemble learning)
# 정형 데이터를 다루는데 가장 뛰어난 성과를 내는 알고리즘
# 대부누 결정 트리를 기반으로 만들어져 있다

# 랜덤 포레스트(Random Forest)
# 앙상블 학습의 대표 주자 중 하나로 안정적인 성능을 낸다
# 결정 트리를 랜덤하게 만들어 결정 트리(나무)의 숲을 만든다
# 각 결정 트리의 예측을 사용해 최종 예측을 만든다

# 각 노드를 분할할 때 전체 특성 중에서 일부 특성을 무작위로 고른 다음 이 중에서 최선의 분할을 찾는다
# 분류 모델인 RandomForestClassifier는 기본적으로 전체 특성 개수의 제곱근만큼의 특성을 선택한다
# 즉 4개의 특성이 있다면 노드마다 2개를 랜덤하게 선택하여 사용한다

# 회귀 모델인 RandomForestRegressor는 전체 특성을 사용한다

# 사이킷런의 랜덤 포레스트는 기본적으로 100개의 결정 트리를 이런 방식으로 훈련한다
# 그다음 분류일 떄는 각 트리의 클래스별 확률을 평균하여 가장 높은 확률을 가진 클래스를 예측으로 삼는다
# 회귀일 때는 단순히 각 트리의 예측을 평균한다

# 랜덤 포레스트는 랜덤하게 선택한 샘플과 특성을 사용하기 떄문에 훈련 세트에 과대적합되는 것을 막아주고
# 검증 세트와 테스트 세트에서 안정적인 성능을 얻을 수 있다
# 종종 기본 매개변수 설정만으로도 아주 좋은 결과를 낸다

# 부트스트랩 샘플(bootstrap sample)
# 데이터 세트에서 중복을 허용하여 데이터를 샘플링하는 방식을 부트스트랩 방식이라고 한다
# 랜덤 포레스트는 각 트리를 훈련하기 위한 데이터를 랜덤하게 만든다
# 입력한 훈련 데이터에서 랜더마게 샘플을 추출하여 훈련 데이터를 만든다
# 이때 한 샘플이 중복되어 추출될 수도 있다

# 예를 들어 1000개의 샘플이 들어있는 가방에서 100개의 샘플을 뽑는다면 
# 먼저 1개를 뽑고 뽑았던 1개를 다시 가방에 넣는다
# 이런 식으로 계속해서 100개를 가방에서 뽑으면 중복된 샘플을 뽑을 수 있다

# 기본적으로 부트스트랩 샘플은 훈련 세트의 크기와 같게 만든다

# 분류 = 샘플을 몇 개의 클래스 중 하나로 분류
# 회귀 = 임의의 어떤 숫자를 에측하는 문제