# 순차 데이터(sequential data)
# 텍스트나 시계열 데이터(time series data)와 같이 순서에
# 의미가 있는 데이터를 말한다
# 예를 들어 I am a boy는 가능하지만 boy am a I는 불가능하다

# 시계열 데이터는 순서를 유지하며 신경망에 주입해야 한다
# 단어의 순서를 마구 섞어서 주입하면 안 된다
# 따라서 순차 데이터를 다룰 때는 이전에 입력한 데이터를 기억하는 기능이 필요하다
# 예를 들어 별로지만 추천해요 에서 추천해요가 입력될 때 별로지만을 기억하고 있어야
# 이 댓글을 무조건 긍정적이라고 판단하지 않을 것이다

# 완전 연결 신경망이나 합성곱 신경망은 이런 기억 장치가 없다
# 하나의 샘플(또는 하나의 배치)을 사용하여 정방향 계산을 수행하고 나면 그 샘플은
# 버려지고 다음 샘플을 처리할 때 재사용하지 않는다

# 피드포워드 신경망(feedforward neural network, FFNN)
# 입력 데이터의 흐름이 앞으로만 전달되는 신경망 - 완전 연결 신경망, 합성곱 신경망

# 다음 샘플을 위해서 이전 데이터가 신경망 층에 순환되는 신경망이 순환 신경망이다

# 순환 신경망(recurrent neural network, RNN)
# 일반적인 완전 연결 신경망과 거의 비슷하다
# 완전 연결 신경망에 이전 데이터의 처리 흐름을 순환하는 고리 하나만 추가하면 된다